#include <stdio.h>

//	혼자 공부하는 C언어
#pragma region 1장

//	1강 컴파일러 사용법
/*

 프로그램 작성 순서
 소스 파일 작성 - 컴파일 - 실행

 * 소스파일 : 아스키 코드에 따라 저장된 파일
 * 컴파일 : 소스 파일을 기계어로 바꾸는 과정
 * 실행파일 : 컴퓨터가 이해 할 수 있는 기계어 형태의 파일

 */

 //	1강 연습 문제
 /*
	 1. 컴파일 과정에 맞게 나열 하세요
	 링크, 전처리, 소스 파일 작성, 컴파일

	 제출 답안 : 링크 - 소스 파일 작성 - 전처리 - 컴파일

	 정답 : 소스 파일 작성 - 전처리 - 컴파일 - 링크
	 해설 : 소스 파일을 작성 후 (소스 파일 작성) - 전처리 과정을 먼저 확인 후 (#include,#define 등)
			 - 작성된 소스 코드를 기계어로 변환 후 (컴파일) - 운영체제에 전달 (링크)

	 틀린 이유 : 운영체제에 먼저 링크된 후에 과정이 이루어 지는 줄 알았음
 */

 //	2강 프로그램의 기본 형태와 데이터 출력 방법
 /*

 */
#pragma endregion
